myfile1 = open("1_2.1text.txt","w")
myfile1.write("""
- Томе! Ані звуку.

- Томе! Ані звуку.

- Де ж це він, шибеник, подівся, хотіла б я знати... Томе, озвися!

Ані звуку.

Стара жінка зсунула вниз окуляри й, дивлячись поверх них, роззирнулася по кімнаті; потім підняла окуляри на чоло й поглянула з-під них. Шукаючи таку дрібницю, як хлопець, вона майже ніколи не дивилася крізь скельця: то були парадні окуляри, втіха її душі, і призначалися вони для «вигляду», а не для діла,- так само вона могла б дивитися й крізь дві конфорки з кухонної плити. Якусь мить стара стояла видимо спантеличена, а тоді промовила [16] - не надто сердито, проте досить голосно, щоб її почули меблі в кімнаті:
- Ну стривай, попадешся ти мені в руки!..

Стара не докінчила, бо саме стояла нахилившись і тицяла щіткою під ліжком, отож мусила раз у раз зводити дух. Та з-під ліжка вона виштурхала тільки кота.

- Зроду не бачила такого поганця!

Вона пішла до відчинених дверей, стала на порозі й повела оком по грядках помідорів, зарослих дурманом,- то був її «город». Тома не видно ніде. Тоді вона підвищила голос,- так щоб було чути далі,- й гукнула:

- Гей, То-о-ме!

Раптом позад неї щось шурхнуло, і вона обернулася - саме вчасно, щоб схопити за полу куртки невеликого хлопчиська й не дати йому втекти.

- А, ось ти де! Я ж таки мала б подумати про цю комору. Ти що там робив?

- Нічого.

- Нічого? А ти поглянь на свої руки. І на свій рот.  Це що таке?

- Не знаю, тітонько.
""")

myfile2.open("1_2.2text.txt","w")
myfile.write("""
Але Том уже збагнув, звідки вітер дме, і випередив її наступний хід. [18]

- Дехто з нас поливав собі на голову з помпи. У мене й досі волосся вогке, ось бачите?

Тітка Поллі з досадою подумала, що не скористалася з цього очевидного доказу й дала обвести себе круг пальця. Тоді в неї сяйнула нова думка.

- Але ж, Томе, щоб полити собі на голову з помпи, не треба було розпорювати комір сорочки там, де я зашила, правда? Ану розстебни куртку!

З обличчя в Тома збігла тінь тривоги. Він розстебнув куртку. Комір сорочки був міцно зашитий.

- Що ти скажеш! Ну гаразд, нехай. Я ж таки була певна, що ти не пішов до школи й купався в річці. Та я не гніваюсь на тебе, Томе. Хоч віри тобі, як то кажуть, уже й немає, але часом ти буваєш кращий, ніж здаєшся. Принаймні сьогодні.

Вона й засмутилася тим, що проникливість зрадила її, і водночас була рада, що Том бодай цього разу повівся як годиться.

Аж раптом обізвався Сід:

- Чогось мені здається, ніби ви зашили йому комір білою ниткою, а тут чорна.

- Та певне ж білою!.. Томе!..

Том не став чекати, що буде далі. Уже в дверях він обернувся й гукнув:

- Ну, Сідді, це тобі так не минеться!

У безпечному місці Том роздивився на дві великі голки, застромлені зі споду у вилогу його куртки й обмотані нитками: одна білою, друга - чорною. І пробурмотів сам до себе:

- Вона б зроду не помітила, коли б не Сід...-Чорт її знає! То вона зашиває білою ниткою, то чорною. Щось би вже одне, а то де там устежити. Але Сіда я таки відлупцюю. Буде йому наука.

Том аж ніяк не був Зразковим Хлопчиком у містечку. Та він дуже добре знав такого і страшенно не любив його.

Минуло хвилини зо дві, а може, й менше - і він забув про всі свої злигодні. І не тому, що вони були не такі прикрі й гіркі, як злигодні дорослих людей,- просто їх на якийсь час витіснило нове непереборне захоплення, точнісінько так, як і доросла людина забуває своє горе, збуджена якимсь новим, цікавим для неї ділом. Таким цікавим ділом став для Тома новий спосіб свистіти, щойно перейнятий від одного негра,- і хлопцеві не терпілося повправлятись у ньому на волі. То був особливий, подібний до пташиного, свист, таке собі заливчасте щебетання, яке виходить, коли [19] чаcто-часто доторкатися кінчиком язика до піднебіння,- читач, певно, пригадає, як це робиться, якщо він сам був колись хлопчиком. Не пошкодувавши зусиль, Том скоро опанував цю премудрість і тепер простував вулицею з солодкою музикою на устах і великою вдячністю у душі. Він почував себе, наче астроном, що відкрив нову планету, "але радість його, поза всяким сумнівом, була ще більша, глибша й щиріша, ніж в астронома.

Літні надвечір'я тягнуться довго, і надворі ще не споночіло. Раптом Том урвав свою трель. Перед ним був незнайомець - хлопчина, трохи більший за нього самого. У глухому провінційному містечку Сент-Пітерсберзі будь-яка нова людина, незалежно від статі й віку, являла собою справжню дивовижу. А цей хлопець був ще й добре вдягнений - аж надто добре, як на будень. Просто-таки неймовірно добре. На ньому був гарний новісінький капелюх, застебнута на всі ґудзики, нова й чиста синя сукняна куртка і такі самі нові й чисті штани. До того ж він мав на ногах черевики, а була ще тільки п'ятниця! І навіть краватку на шиї - якусь барвисту стрічку. Одне слово, справляв враження міського жевжика, а Тома від таких аж з душі вернуло. Чим далі він розглядав це виряджене диво, тим вище задирав перед ним носа і тим жалюгіднішим здавався йому власний одяг.

Жоден з хлопців не озивався. Коли зрушав з місця один, зараз же зрушав і другий - але тільки вбік, по колу. Вони весь час трималися лицем до лиця, дивлячись просто в очі один одному. Нарешті Том сказав:

- Вибити тобі бубну?

- Ану спробуй, побачимо.

- Кажу - виб'ю, то й виб'ю.

- Руки короткі.

- А от і виб'ю.

- Не виб'єш.

- Виб'ю!

- Ні, не виб'єш.

- Виб'ю!

- Ні!

Запала ніякова мовчанка. Потім Том спитав:

- Тебе як звати?

- А тобі що до того?

- Ось я тобі покажу, що мені до того.

- Чого ж не показуєш?

- Багато говоритимеш, то й покажу.

- І говоритиму, і говоритиму, і говоритиму! Ну, то що? [20]

- Думаєш, ти велика цяця, еге ж? Та якби я захотів, то помолотив би тебе однією рукою, а другу хай би мені прив'язали за спиною.

- То чого ж не помолотиш? Тільки базікаєш.

- А таки помолочу, як не вгамуєшся.

- Ха-ха, бачили ми таких!

- Слухай, чепуруне! Гадаєш, ти важна птиця, еге ж? Ач якого капелюха напнув!

- Не подобається - то збий його з мене. Збий - і побачиш, що тобі буде.

- Брешеш!

- Сам ти брешеш.

- Ти паскудний брехун і боягуз.

- Ану котися ти, знаєш куди...

- Ще раз пошли мене - і я розвалю тобі голову каменюкою. [21]

- Ой-ой-ой, так і розвалиш!

- Кажу тобі, розвалю!

- То чого ж не розвалюєш? Чого тільки кажеш, а нічого не робиш? Боїшся!

- Я не боюся.

- Боїшся.

- Ні!

- Боїшся!..

Знов запала мовчанка. Обидва знов затупцяли боком, поїдаючи один одного очима. Нарешті зійшлися плече до плеча.

- Забирайся геть звідси! - сказав Том.

- Сам забирайся!

- І не подумаю.

- І я не подумаю.

Бони стояли, кожен спираючись на скісно виставлену вперед ногу, і з ненавистю в очах щосили штовхали один одного. Але ні той, ні той не міг переважити. Нарешті, захекані й розпашілі, обидва обережно послабили натиск, і Том сказав:

- Ти боягуз і слинько! Ось я скажу своєму старшому братові - то він тебе самим мізинцем віддухопелить. А я йому скажу, начувайся!

- Чхав я на твого старшого брата! У мене теж є брат, ще більший за твого, такий, що за одним махом перекине його аж за отой паркан.

(Обидва брати були, звісно, вигадані).

- Брешеш!

- Хоч ти що кажи, а це правда.

Великим пальцем ноги Том провів у пилюці риску і промовив:

- Спробуй тільки ступити за цю риску, то я так тобі дам, що рачки поповзеш. Хто б ти не був, а слізьми вмиєшся.
""")

myfile3.open3("1_2.3text.txt","w")
myfile.write("""
Настав суботній ранок, і все навколо засяяло літніми барвами й свіжістю, забуяло життям. У кожному серці бриніла музика, а коли серце було молоде пісня лилася з уст Кожне обличчя променилося радістю, і кожен перехожий ступав пружно й молодо.

Пишно цвіла біла акація і сповнювала повітря своїми пахощами. Кардіфська гора, що підносилася на околиці містечка, була вкрита рясною зеленню і здаля видавалася справжньою землею обітованою, де панували краса, мир і спокій. [23]

Том з'явився на узбіччі вулиці з відром вапна та довгою малярською щіткою в руках. Він зміряв оком паркан, і вся його радість умить розвіялась, а душу сповнила глибока туга. Тридцять ярдів дощаного паркана заввишки дев'ять футів! Увесь світ здався йому нікчемним і безглуздим, а саме життя - важенним тягарем. Зітхнувши, він умочив щітку у відро й провів нею по верхній дошці паркана, тоді зробив те саме ще й ще раз і, порівнявши жалюгідну білу смужку з безмежним небіленим обширом, скрушно сів на огорожку коло дерева.

Із хвіртки, наспівуючи «Дівчата з Буффало», підстрибцем вибіг Джім з бляшаним відром у руці. Ходити по воду до міської помпи звичайно здавалося Томові марудним ділом, але тепер він подумав, що це не так уже й погано. Згадав, що коло помпи завжди велелюдно: білі й чорні хлопці та дівчата, дожидаючи своєї черги, відпочивали там, мінялись іграшками, сварилися, билися, пустували. Згадав і те, що хоча до помпи було всього якихось півтораста кроків, Джім ніколи не повертався з водою раніш як за годину, та й то доводилося мало не щоразу когось по нього посилати. [24]

- Слухай, Джіме,- сказав Том,- давай я принесу води, а ти тут трохи побілиш.

Джім похитав головою і відповів:

- Не можу, паничу Томе. Стара пані звеліли мені мерщій іти по воду й не спинятися ніде дорогою. Вони сказали : мабуть, панич Том покличуть мене білити паркан, то щоб я йшов собі й робив своє діло, а про паркан вони самі подбають.

- Та не слухай ти її, Джіме. Вона багато чого каже. Дай-но мені відро - я миттю зганяю. Вона й не знатиме нічого.

- Ой ні, паничу Томе, боюся. Стара пані голову мені одірвуть. Бачить бог, одірвуть.

- Вона? Та вона ніколи нікого не скривдить, хіба що наперстком по голові стукне - а хто ж цього боїться? Говорить вона справді всякі страхіття, але ж від тих балачок ніякої шкоди, якщо тільки вона сама не плаче... А я дам тобі кульку, Джіме. Білу, мармурову!

Джім завагався.

- Білу мармурову кульку, Джіме! Це ж просто чудо.

- Ой, то чудова кулька, паничу Томе, побий мене бог! Але я так страшенно боюся старої пані...

- А ще, коли хочеш, я покажу тобі свою болячку на нозі.

Джім був усього лише людина і перед такою спокусою встояти не міг. Він поставив відро, взяв білу мармурову кульку й з величезною цікавістю схилився над великим пальцем Томової ноги, з якого той помалу розмотував пов'язку. Але вже наступної миті Джім щодуху мчав вулицею, побрязкуючи відром і щулячись від болю нижче спини, Том завзято білив паркан, а тітка Поллі залишила бойовище з пантофлею в руці й тріумфом у очах.

Але завзяття Томового вистачило ненадовго. Він почав думати про те, як весело мав провести суботній день, і його опосів ще більший смуток. Скоро інші хлопці, вільні як птахи, рушать до всяких принадних місць, і як же вони збиткуватимуться з Тома, коли побачать, що він мусить працювати,- сама ця думка пекла його вогнем. Він видобув на світ свої скарби й почав роздивлятись їх: поламані дрібнички, кульки, інший мотлох,- усе воно, може, й пішло б в обмін на чужу працю, але навряд чи його вистачило б, щоб купити бодай півгодини цілковитої волі. Отож, облишивши будь-яку надію підкупити товаришів, він сховав до кишені ті вбогі цяцьки, і в цю ж таки темну хвилину [25] зневіри на нього раптом зійшло натхнення. Атож, не що інше, як чудове запаморочливе натхнення.

Том узяв щітку й заходився спокійно працювати далі. Незабаром у кінці вулиці показався Бен Роджерс - той самий хлопець, чиїх насмішок він боявся над усе. Бен посувався вперед таким собі веселеньким підтюпцем-ви-стрибцем, і це свідчило, що душа його сповнена радості й добрих сподівань. Він їв яблуко і час від часу видавав протяглий мелодійний гудок, а за ним басовите «дін-дон-дон, дін-доН дон» - то він зображував із себе пароплав.

Наближаючись, Бен сповільнив швидкість, вийшов на середину вулиці і, нахилившись на правий борт, повернув до узбіччя - неквапливо, старанно й з належною солідністю, бо вдавав «Велику Міссурі», що мала осадку в дев'ять футів. Він був водночас і пароплав, і капітан, і сигнальний дзвін, отож мусив уявляти, ніби стоїть сам на собі, на капітанському містку, сам дає команди й сам їх виконує.

- Спиняй машину! Дін-дін-дін! - Пароплав майже втратив швидкість і, ледь посуваючись, наближався до берега.- Здай назад! Дін-дін-дін! - Обидві його руки нерухомо витяглись по боках.- Ще трохи назад з правого борту! Дін-дін-дін! Чу чу-чу! - Його права рука тим часом [26]виписувала широкі оберти, вдаючи сорокафутове колесо.- Ще трохи назад з лівого борту! - Почала обертатися ліва рука.- Стоп, правий борт! Дін-дін-дін! Стоп, лівий борт! Помалу вперед з правого борту! Стоп! Ще трохи з лівого борту! Дін-дін-дін! Чу-чу-чу!.. Віддати носовий швартов! Ворушись!.. Віддати задній! Гей там, не барися! Намотуй, намотуй! А тепер пускай!.. Машину спинено, сер! Дін-дін-дін! Шш-ш! Шш-ш! Шш-ш!.. (Це машиніст випускав пару). Том білив собі й не звертав на пароплав анінайменшої уваги. Бен пильно подивився на нього й мовив:

- А-а! То це тебе тут пришвартували, он як?

Відповіді не було. Том оглянув свій останній мазок очима митця, тоді ще раз легенько провів щіткою по паркану і знов подивився, як вийшло. Бен підійшов і став поруч нього. Томові так захотілось яблука, що аж слина покотилася, та він не облишав свого діла.

- То що, друже, мусимо працювати? - спитав Бен. Том рвучко обернувся і сказав:

- А, це ти, Бене! Я тебе й не помітив.

- Слухай, я оце йду купатися. Я, розумієш? А ти не хочеш? Та ні, ти, мабуть, краще попрацюєш, еге ж? Ну звісно, що попрацюєш.

Том якусь хвилю замислено дивився на товариша, тоді спитав:

- Що ти називаєш працею?

- А оце що - хіба не праця?

Том знову взявся білити й недбало відказав:

- Ну що ж, може, праця, а може, й ні. Я знаю тільки, що Томові Сойєру вона до вподоби.

- Ха, можна подумати, що тобі й справді подобається білити!

- Чи подобається? А чом би й ні? Хіба нам кожного дня випадає білити паркани?

Тепер усе постало в новому світлі. Бен навіть забув про своє яблуко. А Том ретельно водив щіткою туди й сюди, відступав на мить і дивився, як виходить, тоді щось підправляв то там, то там і знов дивився. Бен стежив за кожним його рухом з дедалі більшою цікавістю і захопленням. Раптом він сказав:

- Слухай, Томе, дай і мені трохи побілити.

Том поміркував і спершу начебто ладен був погодитись, але потім передумав.

- Та ні, Бене, мабуть, нічого не вийде. Розумієш, тітка Поллі дуже прискіпується до цього паркана - він же, бач, виходить на вулицю. От якби це був задній паркан, я б [27] не мав нічого проти, та Й вона теж. А щодо цього паркана вона страх яка прискіплива: його треба так ретельно побілити, щоб ніде ані-ні. Певне, так зуміє хіба що один хлопець на тисячу, а може, й на дві тисячі.

- Та невже? Ой Томе, ну дай мені спробувати... хоч трішечки. Якби це ти мене просив, я б дав.

Та я б з охотою, слово честі, але ж тітка Пол-лі... ун і Джім хотів білити, а вона не дозволила, і Сід хо-

- Ну що ж... Та ні, Бене, краще не треба. Я боюся. [28]
""")
print(myfile1.read(),myfile2.read(),myfile3.read())
myfile1.close()
myfile2.close()
myfile3.close()